Autodesk.Revit.DB.ReloadSwapOutInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ReloadSwapOutInfo.CurrentVersion
New version.
Since:
2019

Autodesk.Revit.DB.ReloadSwapOutInfo.PreviousVersion
Previous version.
Since:
2019

Autodesk.Revit.DB.ReloadSwapOutInfo.WasSwapped
Whether the swap out was successful.
Since:
2019

Autodesk.Revit.DB.ReloadSwapOutInfo.Part
The ElementId of part being swapped.
Since:
2019

Autodesk.Revit.DB.ReloadSwapOutInfo
This object contains information about fabrication parts swapped out during reload.
Since:
2019